const Data = [
    {
        id: 1,
        title: 'ماسال گیلان',
        description: 'به ماسال سفر کرده‌اید؟ گیلان را گشته‌اید؟ اگر هنوز نمی‌دانید ماسال کجاست و در کدام قسمت گیلان زیبا قرار دارد باید به شما بگوییم که در شناخت یکی از زیباترین نقاط خطه شمال کمی کوتاهی کرده‌اید. اما عیبی ندارد. با خواندن این مقاله متوجه خواهید شد که ماسال دیدنی در همسایگی کوه‌های تالش چقدر زیباست و چرا این‌قدر اصرار داریم که با این شهر کوچک و جذاب آشنا شوید.',
        imgSrc: 'https://www.jabama.com/mag/wp-content/uploads/2020/03/where-is-masal04.jpg',
    },
    {
      id: 2,
      title: 'هتل عباسی اصفهان',
      description: 'هتل پنج ستاره مجلل عباسی، کهن‌ترین هتل جهان و یکی از بزرگ‌ ترین هتل‌های ایران، با قدمتی ۳۰۰ ساله در خیابان چهارباغ عباسی شهر موزه‌‌‌‌ای اصفهان واقع شده است. این هتل در سال ۱۱۰۶ هجری قمری به دستور شاه سلطان حسین صفوی با معماری شکوهمند ایرانی طراحی و بنا گردیده و در سال ۱۳۵۱ بنای آن به سبکی مدرن با امکانات رفاهی کم نظیر و مطابق با استاندارد جهانی مورد بازسازی قرار گرفت.',
      imgSrc: 'https://media.khabaronline.ir/d/2020/02/05/0/5339203.jpeg',
    },
    {
      id: 3,
      title: 'حافظیه شیراز',
      description: 'در شمال شهر شیراز و جنوب دروازه قرآن آرامگاهی به نام آرامگاه حافظیه قرار گرفته است و بسیاری از گردشگرانی که به شهر شیراز علاقه دارند با خرید بلیط هواپیما به این شهر سفر می کنند و از این آرامگاه بازدید می‌کنند. جالب است بدانید طراح این آرامگاه یک معمار فرانسوی به نام آندره گدار است که به فرهنگ و هنر ایران علاقه خاصی داشت و حدود ۳۲ سال در ایران زندگی می‌کرد. او در مدت اقامتش در ایران خدمت‌های زیادی به ایران کرد از جمله ثبت کردن سه تپه تاریخی به نام‌های سلیمان تپه، زیرز و مازیر. این مقبره در زمان حکومت شاه عباس صفوی و همچنین دوره زندیه نیز مورد مرمت و بازسازی قرار گرفته است. در دوران زندیه بود که بر روی مزار حافظ سنگی از مرمر قرار گرفت. پس از کریم خان زند در سال ۱۲۳۵ و بعد از فوت حافظ، حاکم فارس امارتی به شگل گنبد بر بالای و حوض بزرگی نیز در جلوی آن بنا کرد. علی اکبر فعال اسیری به دلیل رزتشتی بودن اردشیر ( کسی که در سال ۱۲۷۸ بارگاه را مرمت کرد و بر بالای آن کوشکی قرار داد) بنای مرمت شده را ویران کرد و تا سال ۱۱۲۸۰ نیز به همین شکل ویران شده باقی ماند تا اینکه در همین سال شاهزاده ملک منصور (حاکم فارس) کوشکی آهنی به جای چوبی قرار داد. در سال ۱۳۱۰ بر روی دیوار جنوبی این مکان سر در سنگی بزرگی نصب شد. ۶ سال بعد ینی در سال ۱۳۱۶ به دستور شاه به شکل امروزی مرمت و بازسازی شد.',
      imgSrc: 'https://panel.safaraneh.com/wp-content/uploads/2022/01/hafez-000_new.jpg',
    },
    {
      id: 4,
      title: 'پل خواجو اصفهان',
      description: 'پل خواجو از پل‌های تاریخی و زیبای اصفهان است که در عصر خود، جزو زیباترین پل‌های دنیا به شمار می‌رفت. قدم زدن روی این پل،‌ به‌خصوص هنگام غروب و اوایل شب، از لذت‌بخش‌ترین تفریح‌هایی است که گردشگران در برنامه خود قرار می‌دهند. این پل که از دیدنی‌های اصفهان است و سفر به نصف جهان بدون دیدن آن کامل نمی‌شود، علاوه بر زیبایی، اسرار و شگفتی‌هایی دارد که بسیاری را وادار می‌کند تا با نگاهی ریزبینانه قدم بر این پل بگذارند و با همه وجود آن را درک کنند. با کجارو همراه شوید تا گوشه‌ای از این همه زیبایی را به شما نشان دهیم.',
      imgSrc: 'https://images.kojaro.com/2020/9/6fdc7cb3-992f-49d4-9bfe-0058dc332f97.jpg',
    },
    {
      id: 5,
      view: '480',
      title: 'ساحل سرخ جزیره هرمز',
      description: 'جزیره هرمز دنیای شگفتی‌ها و جاذبه‌های رنگارنگ است. سفر به هرمز سرشار از حس هراس، حیرت و آرامش است و خداوند در جزیره زیبای هرمز هنر خود را به نمایش گذاشته است. همه این ویژگی‌ها سبب شده است جزیره هرمز مقصد گردشگری افراد بسیاری در ایران و جهان باشد.',
      imgSrc: 'https://images.kojaro.com/2021/10/ed442378-76fd-4500-b348-c0743eaa1068.jpg',
    },
    {
      id: 6,
      title: 'غار علیصدر همدان',
      description: 'غار علیصدر یکی از شگفتی‌ها و زیبایی‌های آفرینش است و از جاهای دیدنی همدان محسوب می‌شود. این غار تنها غار تالابی ایران و از معدود غارهای آبی قابل قایقرانی جهان است که طولانی‌ترین مسیر قایقرانی را دارد. علیصدر همچنین یکی از بزر‌گ‌ترین غارهای آبی جهان نیز به شمار می‌رود و قدمت آن به دوران دوم زمین‌شناسی یا ژوارسیک (۱۹۰-۱۳۶ میلیون سال قبل) بر‌می‌گردد.',
      imgSrc: 'https://www.alibaba.ir/mag/wp-content/uploads/2020/03/0-850%C3%97440-Alisadr-Cave.jpg',
    },
    {
      id: 7,
      title: 'باغ موزه مقدم تهران',
      description: 'موزه مقدم یکی از خانه‌های تاریخی پایتخت است و از مکان های دیدنی تهران به شمار می‌رود. این خانه محل سکونت خاندان محمدتقی خان احتساب الملک از صاحب‌منصبان مشهور دربار قاجار بوده است. سپس این خانه در اختیار دکتر محسن مقدم، استاد باستان‌شناسی دانشگاه تهران و همسر فرانسوی‌اش سلما، قرار می‌گیرد.',
      imgSrc: 'https://www.ghoghnos.net/blog/wp-content/uploads/2020/01/00-1-1024x675.jpg',
    },
    {
      id: 8,
      title: 'باداب سورت مازندران',
      description: 'چشمه‌های زیبای باداب سورت که به چشمه‌های رنگی نیز معروف هستند، به‌عنوان یکی از جاهای دیدنی ساری، گردشگران زیادی را به‌سمت خود می‌کشانند. این مجموعه‌ چشمه‌های شگفت‌انگیز که دومین اثر طبیعی ملی ایران بعد از کوه دماوند محسوب می‌شود، علاوه‌ بر زیبایی خاص، ارزش درمانی بسیار بالایی دارد و تنها در معدود نقاط از این کره‌ خاکی یافت می‌شود.',
      imgSrc: 'https://www.irannegintravel.com/uploads/Highlights/Badabe%20surt/Badabe%20surt1.jpg',
    },
  ];
  export default Data;
  