import { useState } from 'react';
import './styles.scss';
import KeyboardBackspaceIcon from '@mui/icons-material/KeyboardBackspace';

function Testimonial() {

    const [index, setIndex] = useState(0);
    const data = [
        {
            "id": 0,
            "text": "نادین سافت رو من یه تیم برنامه‌نویس نمیدونم. من در روز بارها با اون‌ها حرف می‌زنم و درخواست‌های زیادی از دوستانم دارم. نادین سافت همیشه به صدای من گوش کرده و امکانات مورد نیازم رو اضافه کرده. من اون‌ها رو دوستان صمیمی خودم می‌دونم. هر ایده‌ای برای پیاده‌سازی دارید با نادین سافت درمیون بزارید. ایده شما و دانش اونا باعث ایجاد یک راهکار حرفه‌ای میشه.",
            "title1": "جناب اقای نظیفی",
            "title2": "مدیریت باشگاه مشتریان کارخانه لوازم خانگی پارس"
        },
        {
            "id": 1,
            "text": "دستشان درد نکند؛ کار و رفتار حرفه ای از ویژگی های بازر این شرکت است. جوان بودن، عدم شناخت کافی و … سبب شده بود که در ابتدای همکاری نگران هایی زیادی پیرامون پروژه وجود داشته باشد. اما بعد اولین نسخه متوجه تجربه خوبشان در کار حرفه ای شدیم.",
            "title1": "جناب آقای دکتر کاظمی",
            "title2": "مدیر واحد فناوری اطلاعات سازمان صدا و سیما"
        },
        {
            "id": 2,
            "text": "نادین سافت رو من یه تیم برنامه‌نویس نمیدونم. من در روز بارها با اون‌ها حرف می‌زنم و درخواست‌های زیادی از دوستانم دارم. نادین سافت همیشه به صدای من گوش کرده و امکانات مورد نیازم رو اضافه کرده. من اون‌ها رو دوستان صمیمی خودم می‌دونم. هر ایده‌ای برای پیاده‌سازی دارید با نادین سافت درمیون بزارید. ایده شما و دانش اونا باعث ایجاد یک راهکار حرفه‌ای میشه.",
            "title1": "جناب اقای نظیفی",
            "title2": "مدیریت باشگاه مشتریان کارخانه لوازم خانگی پارس"
        },
        {
            "id": 3,
            "text": "دستشان درد نکند؛ کار و رفتار حرفه ای از ویژگی های بازر این شرکت است. جوان بودن، عدم شناخت کافی و … سبب شده بود که در ابتدای همکاری نگران هایی زیادی پیرامون پروژه وجود داشته باشد. اما بعد اولین نسخه متوجه تجربه خوبشان در کار حرفه ای شدیم.",
            "title1": "جناب آقای دکتر کاظمی",
            "title2": "مدیر واحد فناوری اطلاعات سازمان صدا و سیما"
        },
        {
            "id": 4,
            "text": "نادین سافت رو من یه تیم برنامه‌نویس نمیدونم. من در روز بارها با اون‌ها حرف می‌زنم و درخواست‌های زیادی از دوستانم دارم. نادین سافت همیشه به صدای من گوش کرده و امکانات مورد نیازم رو اضافه کرده. من اون‌ها رو دوستان صمیمی خودم می‌دونم. هر ایده‌ای برای پیاده‌سازی دارید با نادین سافت درمیون بزارید. ایده شما و دانش اونا باعث ایجاد یک راهکار حرفه‌ای میشه.",
            "title1": "جناب اقای نظیفی",
            "title2": "مدیریت باشگاه مشتریان کارخانه لوازم خانگی پارس"
        },
        {
            "id": 5,
            "text": "دستشان درد نکند؛ کار و رفتار حرفه ای از ویژگی های بازر این شرکت است. جوان بودن، عدم شناخت کافی و … سبب شده بود که در ابتدای همکاری نگران هایی زیادی پیرامون پروژه وجود داشته باشد. اما بعد اولین نسخه متوجه تجربه خوبشان در کار حرفه ای شدیم.",
            "title1": "جناب آقای دکتر کاظمی",
            "title2": "مدیر واحد فناوری اطلاعات سازمان صدا و سیما"
        }

    ];

    const rightBtn = () => {
        const frontCard = document.getElementById(data[index].id);
        document.getElementById(data[index].id).remove();
        document.getElementById("cc").append(frontCard);

        const newIndex = (index + 1) % 6;
        setIndex(newIndex);

    }


    const leftBtn = () => {

        if (index > 0) {

            const parent = document.getElementById("cc")
            const child = document.getElementById(data[index - 1].id);
            parent.insertBefore(child, parent.firstChild);

            var newIndex = index - 1;
            setIndex(newIndex);
        }
    }
    return (
        <div dir="ltr" className="background-everything">
            <div className="cards-container" id="cc">
                {data.map((c) => (
                    <div className="card" key={c.id} id={c.id}>
                        <div>
                            <p>{c.text}</p>
                            <h6 className="text-a">{c.title1}</h6>
                            <h6 className="text-a">{c.id}</h6>
                        </div>
                    </div>
                ))}

            </div>
            <div className="make-center">

            <KeyboardBackspaceIcon onClick={leftBtn} id="pastBtn" />
            <KeyboardBackspaceIcon onClick={rightBtn} id="nextBtn" />
            </div>
            <div>

            </div>
        </div>
    );
}




export default Testimonial;
